---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsRun.GetStairs
source: html/70bc6ef7-27a5-b1a6-aada-7ffedfbf0260.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.GetStairs Method

Returns the stairs to which the stairs run belongs.

## Syntax (C#)
```csharp
public Stairs GetStairs()
```

## Returns
The stairs to which the stairs run belongs.